WuXiaoMuer/STM32Hallo/TFT/1.8 TFT_st7735 128x160/任意GPIO软件SPI/func.h
#ifndef FUNC_H
#include "stm32f1xx_hal.h"
#include "main.h"
#define FUNC_H
//画笔颜色
#define WHITE         	 0xFFFF
#define BLACK         	 0x0000	  
#define BLUE         	 0x001F  
#define BRED             0XF81F
#define GRED 			 0XFFE0
#define GBLUE			 0X07FF
#define RED           	 0xF800
#define MAGENTA       	 0xF81F
#define GREEN         	 0x07E0
#define CYAN          	 0x7FFF
#define YELLOW        	 0xFFE0
#define BROWN 			 0XBC40 //棕色
#define BRRED 			 0XFC07 //棕红色
#define GRAY  			 0X8430 //灰色

// func.h
typedef struct {
    uint16_t width;
    uint16_t height;
    uint8_t rotation; // 0: 正常, 1: 90°, 2: 180°, 3: 270°
} ST7735_Config;

extern ST7735_Config st7735_cfg;

/* USER CODE BEGIN Private defines */
#define LCD_RST1  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3,GPIO_PIN_SET);
#define LCD_RST0  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3,GPIO_PIN_RESET);
//   LCD_DC
#define LCD_DC1  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4,GPIO_PIN_SET);//a0//GPIOB->BSRR=GPIO_BSRR_BS_12
#define LCD_DC0  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4,GPIO_PIN_RESET);//GPIOB->BSRR=GPIO_BSRR_BR_12//

//  LCD_CS
#define LCD_CS1  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6,GPIO_PIN_SET);// GPIOB->BSRR=GPIO_BSRR_BS_10//
#define LCD_CS0  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6,GPIO_PIN_RESET);// GPIOB->BSRR=GPIO_BSRR_BR_10//

//  LCD_CLK
#define LCD_CLK1  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5,GPIO_PIN_SET);// GPIOB->BSRR=GPIO_BSRR_BS_10//
#define LCD_CLK0  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5,GPIO_PIN_RESET);// GPIOB->BSRR=GPIO_BSRR_BR_10//

//  LCD_SDA
#define LCD_SDA1  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7,GPIO_PIN_SET);// GPIOB->BSRR=GPIO_BSRR_BS_10//
#define LCD_SDA0  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7,GPIO_PIN_RESET);// GPIOB->BSRR=GPIO_BSRR_BR_10//


void lcd7735_senddata(uint8_t data);
void lcd7735_send16bData(uint16_t data) ;
void spi2_8b_init(void);
void spi2_16b_init(void);


void lcd7735_putstr_vertical(unsigned char x, unsigned char y, const unsigned char str[], unsigned int charColor, unsigned int bkgColor);

//初始化
void lcd7735_ini(void);
//发送数据
void lcd7735_sendData(unsigned char data);
//发送命令
void lcd7735_sendCmd(unsigned char cmd); 
// 点亮指定区域
void lcd7735_fillrect(unsigned char startX, unsigned char startY, unsigned char stopX, unsigned char stopY, unsigned int color);
//点亮像素点
void lcd7735_putpix(unsigned char x, unsigned char y, unsigned int Color);
// 画线
void lcd7735_line(unsigned char x1, unsigned char y1, unsigned char x2, unsigned char y2, unsigned int color);
// 绘制矩形（未填充）  
void lcd7735_rect(char x1,char y1,char x2,char y2, unsigned int color);
//输出单个字符
void lcd7735_putchar(unsigned char x, unsigned char y, unsigned char chr, unsigned int charColor, unsigned int bkgColor);
//输出字符串	 
void lcd7735_putstr(unsigned char x, unsigned char y, const unsigned char str[], unsigned int charColor, unsigned int bkgColor);
// 计算指定屏幕区域
void lcd7735_at(unsigned char startX, unsigned char startY, unsigned char stopX, unsigned char stopY) ;
//输出32*32中文	//
void showhanzi32(unsigned int x,unsigned int y,unsigned char index, unsigned int charColor,unsigned int bkgColor);

void showimage(uint16_t x,uint16_t y);
#endif
